import React, { useState } from 'react';
import light from './../../../images/light.jpg'
import flowers from './../../../images/flowers.jpg'
import alo from './../../../images/alo.jpg'



const ReadMore = ({ children }) => {
    const text = children;
    const [isReadMore, setIsReadMore] = useState(true);
    const toggleReadMore = () => {
        setIsReadMore(!isReadMore);
    };
    return (
        <p className="text">
            {isReadMore ? text.slice(0, 150) : text}
            <span onClick={toggleReadMore} className="read-or-hide">
                {isReadMore ? "  ...Read more" : "   Show less"}
            </span>
        </p>
    );
};



const Blog = () => {
    return (
        <div className='container-fluid my-5 py-5 Blogs'>
            <h1 style={{ fontFamily: "cursive" }} className='text-center my-5 text-primary'>Our Latest Blogs</h1>
            <div class="row row-cols-1 row-cols-md-3 g-4 container-fluid mb-3">

                <div class="col">
                    <div class="card">
                        <img src={light} class="card-img-top" className='img-fluid' alt="..." />
                        <div class="card-body">
                            <h5 class="card-title">গুনাহ এবং অনুতপ্ত, অনুশোচনা</h5>
                            <p><small>আরিফ আজাদ</small></p>
                            <p class="card-text">
                                <ReadMore>'গুনাহ করার পর যদি আপনি ভিতরে ভিতরে দগ্ধ হোন, অনুতপ্ত হোন, অনুশোচনায় যদি কাতর হয়ে উঠে আপনার তনুমন, তাহলে জানুন— আপনার অন্তরের কোথাও এখনও জিইয়ে আছে একটুকরো সবুজ। সেই সবুজকে বাড়তে দিলে তা একদিন ঘন অরণ্যে পরিণত হবে। তাতে যদি পানি দেওয়া হয়, পরিচর্যা করা হয়, সেই সবুজের অরণ্যে মহীরুহের মেলা বসবে একদিন।
                                    কোন গুনাহের পরে 'আল্লাহর সামনে কিভাবে দাঁড়াবো' এই ভয়ে যদি প্রকম্পিত হয় অন্তর, তাহলে নিশ্চিত হোন— আপনার হৃদয়ের কোথাও এখনও মিটিমিটি করে জ্বলছে একটুকরো আলো। আলোটাকে নিভতে না দিয়ে যদি আরো ভালোভাবে জ্বলে উঠার ব্যবস্থা করা যায়, তাহলে অন্ধকার হৃদয় একদিন আলো ঝলমলে এক উঠোনে পরিণত হবে।
                                    গুনাহের পরও আল্লাহ আপনাকে সুযোগ দেন। অনুতপ্ত হবার সুযোগ, অনুশোচনা করার সুযোগ। সুযোগগুলো লুফে নিন। কখনো হেলায় হারাবেন না।'
                                </ReadMore></p>

                        </div>
                    </div>
                </div>

                <div class="col">
                    <div class="card">
                        <img src={flowers} class="card-img-top" className='img-fluid' style={{ height: "255px" }} alt="..." />
                        <div class="card-body">
                            <h5 class="card-title">বিয়ে এবং মানুষের জীবন</h5>
                            <p><small>বদরুদ্দীন আর-রাব্বানী</small></p>
                            <p class="card-text">
                                <ReadMore>বিয়ে মানুষের জীবনের গুরুত্বপূর্ণ অধ্যায়৷ পুরুষের ব্যক্তিত্বের বিকাশ পরিপূর্ণভাবে হয়ত বিয়ের পরই ঘটে৷ বিয়ের আগে নিজেকে ভালোভাবে গড়ে তুলতে হয়৷ বিয়ের আগেই, হুট করে কিছু করার অভ্যাস এবং খামখেয়ালি ত্যাগ করার গুরুত্ব আমার মতো অবিবাহিতের জানা সম্ভব না, তবু মনে হয় এর যথেষ্ট প্রয়োজনীয়তা আছে৷
                                    একসময় আমি প্রচুর পরিমাণে কবিতা, উপন্যাস, গল্প এবং বিভিন্ন মতবাদ বিষয়ক প্রবন্ধ পড়েছি৷ এগুলো নিয়ে যৎসামান্য লিখতামও ফেসবুকে৷ ফুকো, চমস্কির মতো কাঠখোট্টা লেখকদের রচনাও গোগ্রাসে গিলেছি৷ প্রেম এবং বিরহ নিয়ে মুক্তগদ্য লিখতাম বেশি৷ অনেকেই ভাবত না জানি কতজনের ছ্যাঁকা খেয়েছে৷ লেখা আর কল্পনার ভেতর কখনো মনে হতো সত্যিই আমাকে কে যেন ছেড়ে গেছে, অথচ বাস্তবতা ভিন্ন৷ কয়েকবার হ্যালুসিনেশনের কবলেও পড়েছি৷
                                    গতবছর সর্বপ্রথম বিয়ের চিন্তা মাথায় আসে৷ একদিন রাতে, বাহিরে জোছনার আলোয় সবকিছু তখন শাদা৷ সহপাঠী সবাই ঘুমে৷ কিছুতেই ঘুম আসছে না৷ বাইতুস সালাম মসজিদের সামনে ঘাসের উপর খালিপায়ে হাঁটছি৷ এপিবিএন হেড কোয়ার্টারে একটানা কুকুরের ঘেউঘেউ৷ হঠাৎ ভাবনা আসল এখন যদি আমার বিয়ে হয়ে যায়, পরবর্তী সময়টা কেমন হবে?
                                    যদি প্রচণ্ড আত্মমর্যাদাশীলা কেউ জীবনে আসে আর সে প্রেম-বিরহের গল্প-গদ্যগুলো পড়ে বলে এগুলো কেন লিখেছেন? আপনি যে পরিমাণ গল্প-উপন্যাস পড়েছেন সালাফের ওই পরিমাণ কিতাবাদি মুতালাআর সৌভাগ্য হয়েছে?
                                    তাছাড়াও আমি এগুলো কেন লিখছি, বিরহ তো পুরোপুরি পাশ্চাত্য সংস্কৃতি৷ জীবনে চলতে-ফিরতে যে কারও প্রতি দুর্বলতাবশত আমাদের আকর্ষণ অনুভব হতেই পারে, কিন্তু এগুলোর পুনরাবৃত্তি কতটুকু সঠিক?
                                    ভাবতে ভাবতে কোনো উত্তর পাইনি৷ তখনও কয়েকটা কুকুর ডেকে চলছে, আমি আস্তে করে রুমে চলে আসলাম৷
                                    ফেসবুকের ফ্রেন্ডলিস্টে মহিলা আর কট্টর সেক্যুলার লেখকদের সংখ্যা ছিল অনেক৷ আস্তে আস্তে সব কয়টাকে আনফ্রেন্ড করে দিলাম৷ এরপর তেমনভাবে আর গল্প-উপন্যাস ছুঁয়েও দেখিনি৷ প্যারোডি, মুক্তগদ্য আজপর্যন্ত লিখিনি৷ কখনো হাত নিশপিশ করে, অনেক কষ্টে নিজেকে সংযত রাখি৷
                                    পাঠের তালিকায় বেশিরভাগ রেখেছি নিকটস্থ আকাবির আর সালাফের কিতাবাদি৷ যদিও বিভিন্ন প্রয়োজনে ইউরোপীয় দার্শনিক-বুদ্ধিজীবীদের লেখা পড়তে হয়৷ কিন্তু কখনো পাঠের তালিকায় গল্প-উপন্যাসের কোনো বই রাখিনি৷
                                    যেকোনো বৃত্ত থেকেই বেরুনো অনেক কঠিন, আমি হয়ত এখনও পুরোপুরি বের হতে পারিনি
                                </ReadMore></p>
                        </div>
                    </div>
                </div>
                <div class="col">
                    <div class="card">
                        <img src={alo} class="card-img-top img-fluid" alt="..." />
                        <div class="card-body">
                            <h5 class="card-title">কোয়ান্টাম মেথড: তাওহিদ ও শিরকের সংঘাত</h5>
                            <p><small>বদরুদ্দীন আর-রাব্বানী</small></p>
                            <p class="card-text">
                                <ReadMore>মুসলিম জনসাধারণের ঈমান রক্ষা করে চলা বর্তমান ফিতনাসঙ্কুল সময়ে বেশ কঠিন৷ একটি ফিতনার চ্যালেঞ্জ মোকাবেলার আগেই আরেকটির আবির্ভাব ঘটে৷ এভাবে ঘটতেই আছে৷ খুব সহজেই মানুষকে ঈমানহারা করছে যে ফিতনা, সেটি ইন্টারফেইথ অর্থাৎ সকল ধর্মই সমান মতবাদটা৷ এর পরিপূরক হিশেবে কাজ করছে আরও অসংখ্য মতবাদ৷ তন্মধ্যে ‘কোয়ান্টাম মেথড’ সবচেয়ে বেশি সক্রিয়৷ উভয়ের মধ্যে দৃশ্যমান কিছু ফারাক থাকলেও ‘সকল ধর্মই মর্যাদায় সমান’ পরিকল্পনায় দুটোকেই একইসূত্রে গাঁথা মনে হয়েছে৷
                                    কোয়ান্টাম মেথডের ধোঁকাবাজি ও স্বরূপ বোঝার ক্ষেত্রে ‘ইসলাম ও কোয়ান্টাম মেথড: তাওহিদ ও শিরকের সংঘাত’ বইটি যথেষ্ট কাজে লাগবে৷ লেখক গ্রন্থটিতে কুরআন-সুন্নাহর আলোকে কোয়ান্টামের স্বরূপ উদ্ঘাটন করেছেন৷
                                    গ্রন্থটির কলেবর ছোট৷ অল্প সময়েই পড়ে ফেলা যাবে৷ আল্লাহ বই এবং লেখককে কবুল করুন এবং সকলকে সব ধরনের ফিতনা থেকে হেফাজত করুন৷
                                </ReadMore></p>
                        </div>
                    </div>
                </div>
                <button className='mx-auto w-50 text-center border border-primary btn btn-outline-primary py-3 text-uppercase fw-bold'>View All Blogs</button>
            </div>
        </div >
    );
};

export default Blog;