[
    {
    "id":0,
    "name":"ম্যাসেজ",
    "author":"মিজানুর রহমান আজহারি",
    "rating":5,
    "category":"dawah",
    "publishYear":2021,
    "Description":"ইসলাম এক নক্ষত্র যার সংস্পর্শে সমস্ত আঁধার বিলীন হয়ে যায়, ঘোর অমানিশাও তাতে নিজেকে সঁপে দিয়ে আলোকোজ্জ্বল হয়। ইসলাম তো এমন এক জ্যোতিষ্ক, যা উৎসারিত হয়েছে আরশে আজিমের মহিমান্বিত রওশন থেকে। জাহেলিয়াত পরাজয় কবুল করেছিল ইসলামের বুকে আশ্রয় পেয়ে। এই পবিত্র দ্বীন আত্মাকে করেছে প্রশান্ত, চরিত্রকে করেছে নিষ্কলুষ, জীবনকে করেছে সার্থক, মানবতাকে দিয়েছে মুক্তি। এর আলোকচ্ছটা যে জমিনে পড়েছে, সেখানে অঙ্কুরিত হয়েছে শান্তির সবুজ তরু। এই রওশনের ঝলক যে হৃদয় ধারণ করেছে, সে হৃদয় হয়েছে দারাজ দিল। যে যুগ ধারণ করেছে, তা হয়েছে খইরুল কুরুন বা সর্বোত্তম যুগ।কিন্তু হায়! অজ্ঞতা ও অবহেলার কালো মেঘে সেই সূর্য আজ মেঘ লুপ্ত। আলোহীন এ ধরায় উঠে না প্রাণের জোয়ার। তোলে না কেউ আর মানবতার জয়োধ্বনি। অধিকার হারিয়ে মুমূর্ষুপ্রায় মানবতা। নব্য জাহেলিয়াতের এই গাঢ়-কালো মেঘপুঞ্জ চুর্ণ করতে দরকার একটি নির্ভেজাল ঈমানি দমকা হাওয়া; যে হাওয়ায় জ্ঞানের সৌরভ মিশে মোহিত করবে প্রতিটি হৃদয়। সেই মোহনীয় দক্ষিণা হাওয়ার গুঞ্জন তুলতেই আমাদের আয়োজন-'ম্যাসেজ'",
    "img":"https://i.ibb.co/c2v5dsm/book2.jpg"

},
{
    "id":1,
    "author":"হেনরি ফোর্ড",
    "name":"সিক্রেটস অব জায়োনিজম",
    "rating":4,
    "category":"ইতিহাস ও সভ্যতা",
    "publishYear":2020,
    "Description":" আমেরিকার বিখ্যাত ফোর্ড মোটরগাড়ি কোম্পানির প্রতিষ্ঠাতা মালিক হেনরি ফোর্ড। কর্পোরেট দুনিয়ার অন্যতম সফল উদ্যোক্তা। কোম্পানি পরিচালনা করতে গিয়ে একটা পর্যায়ে তাঁর তো চক্ষু চড়কগাছ! এ কি! ইহুদিদের জায়োনিস্ট জাল অক্টোপাসের মতো ঘিরে ধরেছে পৃথিবীকে! তিনি উপলব্ধি করলেন, পৃথিবীর শান্তি অব্যাহত রাখতে হলে বিশ্ববাসীকে জায়োনিস্ট ম্যাকানিজম কীভাবে ফাংশন করে, তা জানিয়ে দিতে হবে।ফোর্ড ১৯২০ সালে শুরু করলেন নিজের পত্রিকা দ্যা ডিয়ারবর্ন ইনডিপেন্ডেন্ট। সেখানে ৮০ পর্বের ধারাবাহিক কলামে তুলে ধরলেন দুনিয়াব্যাপী বিস্তৃত ইহুদি নেটওয়ার্ক। আমেরিকান ব্যবসায়ীর কলমে জায়োনিস্ট মুখোশ উন্মোচিত হওয়ায় চারিদিকে শুরু হলো তুমুল হইচই। ইতোমধ্যে ফোর্ড-এর কলামসমূহ একত্রিত করে চার খণ্ডের বই তৈরি হলো; নাম- The International Jew। প্রতিক্রিয়ায় ইহুদি লবি জবাব দিতে লাগল। আমেরিকা থেকে কয়েকদিনের ব্যবধানেই সব বই লাপাত্তা! ফোর্ড-এর পত্রিকার বিরুদ্ধে সম্প্রীতি নষ্টের উসকানির অভিযোগ উঠল। ১৯২৭ সালে বন্ধ করে দেওয়া হলো তাঁর পত্রিকা এবং আলোচিত এই বই।কিন্তু চাইলেই কি সব বন্ধ করে দেওয়া যায়? আশির দশকে আবার প্রকাশিত হলো বইটি। দুনিয়াব্যাপী ২৩টি ভাষায় অনূদিত হলো। বিশ্বখ্যাত সেই বইটির বাংলা অনুবাদ ‘সিক্রেটস অব জায়োনিজম : বিশ্বব্যাপী জায়োনিস্ট ষড়যন্ত্রের ভেতর-বাহির’।  ",
    "img":"https://i.ibb.co/Y0DnmHZ/book1.jpg"

},
{
    "id":2,
    "name":"সুলতান সালাহুদ্দিন আইয়ুবি",
    "author":"ড. আলি মুহাম্মাদ সাল্লাবি",
    "rating":5,
    "category":"dawah",
    "publishYear":2021,
    "price":"৳ 658",
    "Description":"সুলতান সালাহুদ্দিন আইয়ুবি। বিশ্ব-ইতিহাসের মহাবীর। ক্রুসেডবিরোধী সেনানায়ক। তাঁর জীবনের পরতে পরতে মিশে আছে বীরত্বের রোমাঞ্চকর সব কীর্তি। বদলে দিয়েছিলেন পৃথিবীর মানচিত্র। ঘুরিয়ে দিয়েছিলেন ধর্মযুদ্ধের নামে খ্রিষ্টানদের উদ্ভাবিত হিংস্র ক্রুসেডের গতিপথ। অসীম সাহস, ইমানি তেজ ও মহানুভবতার জন্য শত্রুর কাছেও ছিলেন যারপরনাই সম্মানী। ইনসাফ ও শরিয়া প্রতিষ্ঠা করে হয়ে ওঠেন মুসলিম উম্মাহর অনুকরণীয় মহান সুলতান, উম্মাহর ভাগ্যাকাশে সৌভাগ্য আনয়নকারী তারকা।সালাহুদ্দিনের আবির্ভাব আব্বাসি খিলাফতের শাসনকালে। আব্বাসি শাসনকেন্দ্রের দুর্বলতায় পৃথিবী তখন ক্ষমতার বিচ্ছিন্ন লড়াইয়ে বিভীষিকাময়; মিসরকেন্দ্রিক গড়ে উঠেছিল শিয়া ফাতিমি সাম্রাজ্য; খলিফার নামমাত্র আনুগত্যে মুসলিম ভূখণ্ডগুলো স্বাধীন সাম্রাজ্যে বিভক্ত; ক্রুসেডারদের হিংস্র আক্রমণে সকল জনপদ আতঙ্কিত; আকসাকে হারিয়ে উম্মাহ হতবিহ্বল-পেরেশান! তখন এই মহান বীর নির্ভীকচিত্তে নিজেকে নিবেদিত করেন ক্রুসেডারদের সাহায্যকারী ফাতিমি সাম্রাজ্যের বিলুপ্তকরণ, ঐক্য বিনষ্টকারী শাসকদের ক্ষমতাহরণ, ইউরোপীয় ক্রুসেডারদের ঔদ্ধত্য চূর্ণীকরণ, জেরুসালেম মুক্তকরণ ও ইসলামের বিরুদ্ধে অস্ত্র উত্তোলনকারী সকল শক্তিকে নিশ্চিহ্ন করে আব্বাসি খিলাফতের পতাকাতলে উম্মাহর ঐক্যের জন্য!আজকের পৃথিবীও একজন নুরুদ্দিন জিনকি ও সালাহুদ্দিনের অপেক্ষায়; দ্বিতীয় খিলাফতে রাশিদার পতাকাতলে সেই ভবিষ্যৎ-কান্ডারি সালাহুদ্দিন আবারও ফিরে আসবে, মুক্ত করবে আকসা; ধূলিসাৎ করবে নব্য ক্রুসেডারদের দম্ভ! এই আকাঙ্ক্ষিত বাস্তবতার অতীত জানতে পড়ুন বিশ্বখ্যাত ইতিহাসবিদ ড. সাল্লাবি রচিত বিশুদ্ধতম এই গ্রন্থ সুলতান সালাহুদ্দিন আইয়ুবি।",
    "img":"https://i.ibb.co/x1wqjYH/book15.jpg"

},
{
    "id":3,
    "name":"উসমানি খিলাফতের ইতিহাস",
    "author":"ড. আলি মুহাম্মাদ সাল্লাবি",
    "rating":5,
    "category":"dawah",
    "price":"৳ 326",
    "publishYear":2021,
    "Description":"খিলাফতব্যবস্থা পৃথিবীর ইতিহাসে দোর্দণ্ড প্রতাপের সঙ্গে দীর্ঘ সময় টিকে থাকা একমাত্র শাসনব্যবস্থা। প্রায় সাড়ে ১৩ শ বছর এই শাসনব্যবস্থা পৃথিবীকে নেতৃত্ব দিয়েছে শান্তি-শৃঙ্খলা ও ইনসাফের সঙ্গে। খিলাফতে রাশিদার পর নেতৃত্বের বাগডোর ছিল বংশপরম্পরায়। সর্বশেষ খিলাফতের নেতৃত্ব দিয়েছে তুর্কি বংশোদ্ভূত উসমানিগণ। ইতিহাসে যাঁরা অটোমান হিসেবে পরিচিত।এই বইয়ে আলোচিত হয়েছে উসমানি সাম্রাজ্যের উত্থান ও পতন নিয়ে। সেলজুক সাম্রাজ্যের পতনের পর উসমানি সাম্রাজ্যের উত্থান ছিল সর্বব্যাপী। জ্ঞান-বিজ্ঞান, রাজনীতি, অর্থনীতি, তথ্যপ্রযুক্তি, যুদ্ধ এবং সমরবিজ্ঞান—এককথায় মানুষের জাগতিক জীবনের এমন কোনো বিভাগ ছিল না, যেখানে উন্নতির ছোঁয়া তারা পৌঁছে দেয়নি।উসমানি সুলতান মুহাম্মাদ আল ফাতিহের কনস্টান্টিনোপল বিজয় ছিল এই সাম্রাজ্যের সবচেয়ে বিস্ময়কর ঘটনা। তাঁর পরবর্তী একের পর এক শক্তিমান সুলতান এসে এশিয়া, আফ্রিকা আর ইউরোপ জয় করে নিয়েছেন। পৃথিবী থেকে অন্যায়, অত্যাচার, অবিচার দূর করে ইসলামের বিজয়পতাকা উড্ডীন করেছেন।একসময় এই বিশাল শক্তিধর সাম্রাজ্য ক্রুসেডীয় আক্রমণে জর্জরিত হয়। সুলতানগণ দুর্বল হতে থাকে। বুদ্ধিবৃত্তিকভাবে মুসলমানরা পশ্চিমাদের নিকট পরাজিত হতে থাকে। জনগণ ও বুদ্ধিজীবী-শ্রেণি পশ্চিমা সেকুলার চিন্তা দ্বারা প্রভাবিত হয়। তারপর নানা ষড়যন্ত্রে শত বছরের প্রচেষ্টায় উসমানি শাসনের পতন ঘটানো হয়।এই বইয়ে আলোচিত হয়েছে কীভাবে উত্থান হয়েছিল উসমানি সাম্রাজ্যের। তারপর কীভাবে খিলাফতের নেতৃত্ব তাঁদের হাতে আসে। কীভাবে এই উসমানি সাম্রাজ্য প্রায় ৭০০ বছর শাসনের পর নেতৃত্ব হারায় এবং সাড়ে ১৩ শ বছর নেতৃত্ব দেওয়া খিলাফতব্যবস্থার পতন হয়। কীভাবে খিলাফতব্যবস্থার পতন ঘটিয়ে পশ্চিমা সেকুলার গণতন্ত্র মুসলিম উম্মাহর ওপর চাপিয়ে দেওয়া হয়। মুসলিম উম্মাহর বিরুদ্ধে আরও নানাবিধ করুণ ষড়যন্ত্রের ইতিহাস এই বইয়ে তুলে ধরা হয়েছে।মুসলিম উম্মাহ আজ হতাশ, দিকভ্রান্ত। তাদের কোনো অভিভাবক নেই। যে যেভাবে পারছে খাবলে খাচ্ছে। তারপরও বিশ্বব্যাপী উম্মাহ ঘুরে দাঁড়াবার প্রচেষ্টায় লিপ্ত। মুসলিম তরুণদের উদ্দীপ্ত করতে,আশার আলো জাগাতে লেখক সুসংক্ষিপ্ত আলোচনা করেছেন, দিক-নির্দেশনা দিয়েছেন। হৃদয় স্পর্শ করা উত্তপ্ত কথামালা দ্বারা জ্বালিয়েছেন চেতনার মশাল। ‍উল্লেখ করেছেন নবিজির হাদিস—‘নবুওয়াতের আদলে আবারও আসবে খিলাফত।’সর্বোপরি বইটি উন্মোচিত করবে আমাদের অতীত-ভুল,যার কারণে মুসলিম উম্মাহ আজ লাঞ্ছিত; দেখাবে বিজয়ের পথ, যার মাধ্যমে আবারও আলোকিত হবে পৃথিবী।",
    "img":"https://i.ibb.co/qpxSq1s/book20.jpg"

},
{
    "id":4,
    "name":"সেলজুক সাম্রাজ্যের ইতিহাস",
    "author":"ড. আলি মুহাম্মাদ সাল্লাবি",
    "rating":5,
    "price":"৳ 560",
    "category":"dawah",
    "publishYear":2021,
    "Description":"ইতিহাস অতীতের নীরব সাক্ষী। ইতিহাস চির-মুখর। যুগ-যুগান্তর ধরে মানব-সভ্যতার চলমান জীবনধারাই ইতিহাস। সে চক্রতীর্থের পথে পথে ছড়িয়ে আছে কত শত ভাঙা-গড়ার অর্ধলুপ্ত অবশেষ—কত রক্তরঞ্জিত দৃশ্যপটের পরিবর্তন; কত নিশীথকালের দুঃস্বপ্ন-কাহিনি; কত উত্থান-পতন, কত চেষ্টার তরঙ্গ, কত সামাজিক বিবর্তন।আজ যা বর্তমান, কালই তা অতীত। ইতিহাস ত্রি-কাল-সূত্রে গ্রথিত। ইতিহাস তো অতীতেরই সত্য-স্বরূপ উদ্ঘাটন—এক অনন্ত মানব-জীবনপ্রবাহের অনির্বাণ দীপ-শিখা। ইতিহাস অতীতের অভিজ্ঞতা, বর্তমানের সাধনা, ভবিষ্যতের ইঙ্গিত।ইতিহাস পাঠের মাধ্যমে আমরা মানবসমাজের শুরু থেকে এর যাবতীয় কর্মকাণ্ড, চিন্তা-চেতনা ও জীবনযাত্রার অগ্রগতি সম্পর্কে জ্ঞান লাভ করতে পারি। এজন্যই ইতিহাসকে বলা হয় জাতির দর্পণ।এ ইতিহাসের সাথে সম্পর্কসূত্রের ধারাবাহিকতায় আমাদের এবারের প্রকাশনা—সেলজুক সাম্রাজ্যের ইতিহাস। ইসলামি ইতিহাসে সেলজুকদের রয়েছে এক স্মরণীয় অধ্যায়। প্রায় ২০০ বছর ধরে তারা অর্ধ পৃথিবী শাসন করেছে অত্যন্ত প্রতাপ, বিক্রম ও ভাঙনের চড়াই-উৎরাই নিয়ে। মুসলিম-ইতিহাস অধ্যয়নে সেলজুক সাম্রাজ্যের ইতিহাসের রয়েছে অন্যতম ভূমিকা। রক্তাক্ত ক্রুসেড যুদ্ধের ইতিহাসের অগ্রসেনানি ছিলেন এ সেলজুকরা।সমৃদ্ধ সেলজুক সাম্রাজ্যের সূচনা, স্থিরতা, ভাঙা-গড়া এবং নানা চড়াই-উৎরাই নিয়ে রচিত আখ্যান সেলজুক সাম্রাজ্যের ইতিহাস।সমকালীন মুসলিম বিশ্বের সুপরিচিত ইতিহাসবিদ ড. আলি মুহাম্মাদ সাল্লাবির বিশ্বস্ত কলমে উঠে এসেছে এই দীর্ঘ ইতিহাসের ফিরিস্তি। তার এই গ্রন্থনার বাংলা অনূদিত রূপ সেলজুক সাম্রাজ্যের ইতিহাস; যা পাঠককে পরিচিত করে দেবে মুসলিম-ইতিহাসের গুরুত্বপূর্ণ এক অধ্যায়ের সাথে।",
    "img":"https://i.ibb.co/2dBys01/book17.jpg"

},
{
    "id":5,
    "name":"স্পেন টু আমেরিকা ",
    "author":"আবু লুবাবা শাহ মানসুর",
    "rating":5,
    "price":"৳ 172",
    "category":"dawah",
    "publishYear":2021,
    "Description":"স্পেন হচ্ছে আমাদের হারিয়ে যাওয়া জান্নাত আর আমেরিকা হচ্ছে আমাদের জন্য দন্তখোলা জাহান্নাম। কীভাবে আমরা সে জান্নাত হারিয়ে আজ জাহান্নামের দ্বারপ্রান্তে ‘স্পেন টু আমেরিকা’ সে হৃদয়বিদারক ইতিহাসের করুণ আখ্যান। বইটি পাঠকালে আপনি প্রকাশ-অযোগ্য হতাশায় কুকড়ে যাবার পাশাপাশি শুনতে পাবেন উম্মাহর সোনালি স্বপ্নের পাজর ভাঙার যন্ত্রণাদায়ক আর্তনাদ। সে সাথে যখন দেখবেন বীর তারিকের উত্তরসূরি মুসা বিন আবি গাসসানের অসহায় একাকিত্ব, লেন্দুপ দর্জি আর মীরজাফরদের ন্যায় গাদ্দারি, পরিণাম-অন্ধ ভোগবাদী শাসকের রাজ্য অপেক্ষা রানির মেকআপের চিন্তা; তখন স্তম্ভিত ও বিমূঢ় হয়ে পড়তে পারেন আপনি।‘স্পেন টু আমেরিকা’য় আপনি পরিচয় পাবেন পরের ধনে পোদ্দারি করা, দুপুরে-ডাকাত, মুসলিম উম্মাহর কৃতিত্ব-চোর নির্লজ্জ ইউরোপীয়দের প্রকৃত চেহারার।দেখতে পাবেন এর পাতায় পাতায় ছড়িয়ে রয়েছে রক্ত আর আগুনের জীবন্ত ইতিহাস। শুনতে পাবেন অশ্রুর মহাসড়ক ধরে মেষ-ছাগলের মতো তাড়িয়ে নিয়ে যাওয়া সরলপ্রাণ অসহায় রেড-ইন্ডিয়ানদের বুকফাটা হাহাকার। লোভের আগুনে ছাই হয়ে যেতে দেখবেন ‘অ্যারাওক’ ও ‘চ্যারোকি’ নামক দুই রেড ইন্ডিয়ান জাতির ইতিহাস। জানতে পারবেন রাজ্যলিপ্সু ফার্দিনান্দ ও চরম মুসলিম-বিদ্বেষী রানি ইসাবেলার মানস-সন্তান আমেরিকানরা কেন মুসলমানদের মোকাবিলায় এতটা হিংস্র? কী তাদের ভবিষ্যৎ টার্গেট।",
    "img":"https://i.ibb.co/f2qcfL8/spen-To-Amerika.jpg"

},
{
    "id":5,
    "name":"তাওহিদের মর্মকথা",
    "author":"ইমাম ইবনু রজব হাম্বলি রহ.",
    "rating":5,
    "price":"৳ 67",
    "category":"dawah",
    "publishYear":2018,
    "Description":"ইসলামের মূল ভিত্তি হচ্ছে তাওহিদ। তাওহিদপন্থীদের জন্যই ঘোষিত হয়েছে জান্নাত। নিষ্কলুষ তাওহিদ নিয়ে যারা মহান প্রতিপালকের সামনে উপস্থিত হবে, তারা লাভ করবে মহা সফলতা। পক্ষান্তরে যারা তাওহিদকে প্রত্যাখ্যান করবে কিংবা যাদের তাওহিদ ত্রুটিযুক্ত থাকবে, প্রতিপালকের সামনে দণ্ডায়মান হওয়ার দিন তারা চরম আক্ষেপে ভুগবে এবং  অবশেষে নিক্ষিপ্ত হবে অপরাধীদের আবাসস্থল জাহান্নামে।তাওহিদের মৌলিক বিষয়াদির জ্ঞান অর্জন করা প্রত্যেক মুসলমানের ওপর ফরজে আইন। যেহেতু তাওহিদ সকলের জন্য, তাই তাওহিদের মৌলিক জ্ঞানকে রাখা হয়েছে অত্যন্ত সহজ, সরল এবং সকলের বোধগম্যরূপে। খ্রিষ্টানদের ত্রিত্ববাদের মতো জটিল কোনো সমীকরণ এতে নেই। তবে দুর্ভাগ্যজনক হলেও সত্য, পরবর্তীরা তাওহিদের মূল বিষয়ের আলোচনা কমিয়ে দিয়ে শাখাগত বিভিন্ন বিষয় নিয়ে অভ্যন্তরীণ চরম দ্বন্দ্বে লিপ্ত হয়েছে। ফলে মুসলিমদের ঐক্যের ভিত্তি তাওহিদকে কেন্দ্র করে অনৈক্য এবং বিভেদের সূত্রপাত হয়েছে। তাই উম্মাহর এই চরম অবক্ষয়ের সময়ে পূর্ববর্তীদের বিশুদ্ধ জ্ঞানকে ব্যাপক থেকে ব্যাপকতর করার কোনো বিকল্প নেই।মহান সালাফে-সালেহিনের রচনার স্বাদ এবং ঘ্রাণই আলাদা। অষ্টম শতকের মহান ইমাম ইবনু রজব রহ.-এর রচনায় খুব সরলভাবে উঠে এসেছে তাওহিদের চিত্র। সব শ্রেণির পাঠকদের জন্যই ইনশাআল্লাহ বইটি সুখপাঠ্য হবে। আল্লাহ তাআলা এই মহান ইমামকে গোটা উম্মাহর পক্ষ থেকে উত্তম প্রতিদান দান করুন।তাওহিদের চেতনা ফের জাগ্রত হোক এ মাটিতে। তাওহিদের আলোয় আলোকিত হোক দল-মত নির্বিশেষে সকলে। দূর হয়ে যাক জাহিলিয়াতের ঘুটঘুটে অন্ধকার। তাওহিদের আলোকিত জ্ঞান-সরোবরে পাঠক, আপনাকে স্বাগতম! দীপ্ত হোন, দীপ্তি ছড়ান।",
    "img":"https://i.ibb.co/86DDnwF/Tawhid-Fianl-scaled.jpg"

}
]
